// 230629_2 final project c++
//
// 1 вариант - создать прогр, которая фильтрует текст введенный с клавиатуры, заменяя набор неподходящих символов на пробелы
// программа должна предложить пользователю фильтры символов (кириллица, латиница, символы, цифры)
//
// 2 вариант - морской бой (таблицы игрового поля с координатами, пользователь вводит координаты и происходит выстрел). Комп должен обладать логикой
//
// 3 вариант - пользователь вводит строки с формулой, которую решает компьютер
//
// 4 вариант - шифр цезаря

#include <iostream>
using namespace std;

int main()
{
    setlocale(LC_ALL, "Rus");
    cout << "*************************************************************************************" << endl;
    cout << "*                Программа шифрования 'ШИФР ЦЕЗАРЯ' beta version 0.1                *" << endl;
    cout << "*************************************************************************************" << endl;
    
    system ("pause");
    system("cls");

    cout << "конец программы" << endl;



}

